
## Plan Result




<pre><code>Plan: 4 to add, 17 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_template_deployment.dtgtwwindows[0]
  * azurerm_template_deployment.dtgtwwindows[1]
  * azurerm_template_deployment.windows[0]
  * time_offset.next_day
* Update
  * azapi_update_resource.ams02_auth
  * azapi_update_resource.ams_auth
  * azurerm_monitor_diagnostic_setting.storageblobfinalsa
  * azurerm_monitor_diagnostic_setting.storageblobingestsa
  * azurerm_monitor_diagnostic_setting.storageblobsa
  * module.finalsa02_storage_account.azurerm_storage_account.storage_account
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa02_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.key-vault.azurerm_key_vault_access_policy.developer[0]
  * module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa_storage_account.azurerm_storage_account.storage_account
  * module.vm_automation.azurerm_automation_schedule.vm-start-stop[&#34;vm-off&#34;]
  * module.vm_automation.azurerm_automation_schedule.vm-start-stop[&#34;vm-on&#34;]
  * module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop[&#34;vm-off&#34;]
  * module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop[&#34;vm-on&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_update_resource.ams02_auth will be updated in-place
  ~ resource "azapi_update_resource" "ams02_auth" {
      ~ body                    = jsonencode(
          ~ {
              ~ properties = {
                  ~ storageAccounts       = [
                      ~ {
                          ~ id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsa02stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsa02stg"
                          ~ identity = {
                              ~ useSystemAssignedIdentity = false -> "false"
                                # (1 unchanged element hidden)
                            }
                          ~ type     = "Secondary" -> "Primary"
                        },
                      ~ {
                          ~ id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsa02stg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsa02stg"
                          ~ identity = {
                              ~ useSystemAssignedIdentity = false -> "false"
                                # (1 unchanged element hidden)
                            }
                          ~ type     = "Primary" -> "Secondary"
                        },
                    ]
                    # (1 unchanged element hidden)
                }
            }
        )
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preams02stg"
        name                    = "preams02stg"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azapi_update_resource.ams_auth will be updated in-place
  ~ resource "azapi_update_resource" "ams_auth" {
      ~ body                    = jsonencode(
          ~ {
              ~ properties = {
                  ~ storageAccounts       = [
                      ~ {
                          ~ id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
                          ~ identity = {
                              ~ useSystemAssignedIdentity = false -> "false"
                                # (1 unchanged element hidden)
                            }
                          ~ type     = "Secondary" -> "Primary"
                        },
                      ~ {
                          ~ id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
                          ~ identity = {
                              ~ useSystemAssignedIdentity = false -> "false"
                                # (1 unchanged element hidden)
                            }
                          ~ type     = "Primary" -> "Secondary"
                        },
                    ]
                    # (1 unchanged element hidden)
                }
            }
        )
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Media/mediaservices/preamsstg"
        name                    = "preamsstg"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobfinalsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobfinalsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/blobServices/default|prefinalsastg"
        name                       = "prefinalsastg"
        # (2 unchanged attributes hidden)


      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobingestsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobingestsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg/blobServices/default|preingestsastg"
        name                       = "preingestsastg"
        # (2 unchanged attributes hidden)


      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobsa will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg/blobServices/default|presastg"
        name                       = "presastg"
        # (2 unchanged attributes hidden)


      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_template_deployment.dtgtwwindows[0] will be created
  + resource "azurerm_template_deployment" "dtgtwwindows" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "windows-update"
      + outputs             = (known after apply)
      + resource_group_name = "pre-stg"
      + template_body       = (known after apply)
    }

  # azurerm_template_deployment.dtgtwwindows[1] will be created
  + resource "azurerm_template_deployment" "dtgtwwindows" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "windows-update"
      + outputs             = (known after apply)
      + resource_group_name = "pre-stg"
      + template_body       = (known after apply)
    }

  # azurerm_template_deployment.windows[0] will be created
  + resource "azurerm_template_deployment" "windows" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "windows-update"
      + outputs             = (known after apply)
      + resource_group_name = "pre-stg"
      + template_body       = (known after apply)
    }

  # time_offset.next_day will be created
  + resource "time_offset" "next_day" {
      + base_rfc3339 = (known after apply)
      + day          = (known after apply)
      + hour         = (known after apply)
      + id           = (known after apply)
      + minute       = (known after apply)
      + month        = (known after apply)
      + offset_days  = 1
      + rfc3339      = (known after apply)
      + second       = (known after apply)
      + triggers     = {
          + "update_time" = "19:40"
        }
      + unix         = (known after apply)
      + year         = (known after apply)
    }

  # module.finalsa02_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsa02stg"
        name                              = "prefinalsa02stg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "86.179.180.2",
                # (49 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "86.179.180.2",
                # (49 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }



        # (4 unchanged blocks hidden)
    }

  # module.ingestsa02_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsa02stg"
        name                              = "preingestsa02stg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "86.179.180.2",
                # (49 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                              = "preingestsastg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "86.179.180.2",
                # (49 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.developer[0] will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "developer" {
      ~ certificate_permissions = [
          - "List",
            "Get",
          - "GetIssuers",
          - "ListIssuers",
          + "List",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      ~ key_permissions         = [
          - "List",
            "Get",
          + "List",
        ]
      ~ secret_permissions      = [
          - "List",
            "Get",
          + "List",
        ]
      ~ storage_permissions     = [
          - "List",
          - "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
            "GetIssuers",
            "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b1fd4154-355f-4683-a795-d09cdb814d16"
      ~ key_permissions         = [
            "List",
          - "Get",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      ~ secret_permissions      = [
            "List",
          - "Get",
          + "Set",
          + "Delete",
        ]
      ~ storage_permissions     = [
          - "List",
          - "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg|pre-stg"
        name                       = "pre-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#Cloud-Native"
            "application"            = "pre-recorded-evidence"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#dts-pre-rec-evidence-tech"
            "environment"            = "staging"
            "managedBy"              = "Pre Recorded Evidence"
        }
        # (36 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "86.179.180.2",
                # (49 unchanged elements hidden)
            ]
            # (3 unchanged attributes hidden)
        }


        # (3 unchanged blocks hidden)
    }

  # module.vm_automation.azurerm_automation_schedule.vm-start-stop["vm-off"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-schedule-stop-vm-18-00-00"
        name                    = "pre-schedule-stop-vm-18-00-00"
      ~ start_time              = "2022-11-03T18:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vm_automation.azurerm_automation_schedule.vm-start-stop["vm-on"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-schedule-start-vm-06-00-00"
        name                    = "pre-schedule-start-vm-06-00-00"
      ~ start_time              = "2022-11-03T06:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop["vm-off"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-dtgtwy-schedule-stop-vm-18-00-00"
        name                    = "pre-dtgtwy-schedule-stop-vm-18-00-00"
      ~ start_time              = "2022-11-03T18:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.vm_automation_dtgtwy.azurerm_automation_schedule.vm-start-stop["vm-on"] will be updated in-place
  ~ resource "azurerm_automation_schedule" "vm-start-stop" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa/schedules/pre-dtgtwy-schedule-start-vm-06-00-00"
        name                    = "pre-dtgtwy-schedule-start-vm-06-00-00"
      ~ start_time              = "2022-11-03T06:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 4 to add, 17 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_monitor_diagnostic_setting.storageblobfinalsa has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobfinalsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg/blobServices/default|prefinalsastg"
        name                       = "prefinalsastg"
        # (2 unchanged attributes hidden)


      + metric {
          + category = "Capacity"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + days    = 0
              + enabled = true
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - enabled = true -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobingestsa has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobingestsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg/blobServices/default|preingestsastg"
        name                       = "preingestsastg"
        # (2 unchanged attributes hidden)


      + metric {
          + category = "Capacity"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + days    = 0
              + enabled = true
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - enabled = true -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # azurerm_monitor_diagnostic_setting.storageblobsa has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "storageblobsa" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg/blobServices/default|presastg"
        name                       = "presastg"
        # (2 unchanged attributes hidden)


      + metric {
          + category = "Capacity"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + days    = 0
              + enabled = true
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - enabled = true -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_key_vault.kv has changed
  ~ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
            # (2 unchanged elements hidden)
            {
                application_id          = ""
                certificate_permissions = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Get",
                ]
                object_id               = "2757c27a-aa98-4cdf-9aaa-90cf47d0656c"
                secret_permissions      = [
                    "List",
                    "Set",
                    "Delete",
                    "Get",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          ~ {
              ~ certificate_permissions = [
                  - "Get",
                    "List",
                  + "Get",
                  + "GetIssuers",
                  + "ListIssuers",
                ]
              ~ key_permissions         = [
                  - "Get",
                    "List",
                  + "Get",
                ]
              ~ secret_permissions      = [
                  - "Get",
                    "List",
                  + "Get",
                ]
              ~ storage_permissions     = [
                  + "List",
                  + "Get",
                ]
                # (3 unchanged elements hidden)
            },
          ~ {
              ~ certificate_permissions = [
                    "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "ManageContacts",
                  - "ManageIssuers",
                  + "Get",
                    "GetIssuers",
                    "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                ]
              ~ key_permissions         = [
                    "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  + "Get",
                ]
              ~ secret_permissions      = [
                    "List",
                  - "Set",
                  - "Delete",
                  + "Get",
                ]
              ~ storage_permissions     = [
                  + "List",
                  + "Get",
                ]
                # (3 unchanged elements hidden)
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Get",
                ]
                object_id               = "64e5c2d9-c957-4038-873f-7eb4e6250c7d"
                secret_permissions      = [
                    "List",
                    "Set",
                    "Delete",
                    "Get",
                ]
                storage_permissions     = [
                    "List",
                    "Set",
                    "Delete",
                    "Get",
                ]
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
        name                            = "pre-stg"
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "application"         = "pre-recorded-evidence"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.developer[0] has changed
  ~ resource "azurerm_key_vault_access_policy" "developer" {
      ~ certificate_permissions = [
          - "Get",
            "List",
          + "Get",
          + "GetIssuers",
          + "ListIssuers",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      ~ key_permissions         = [
          - "Get",
            "List",
          + "Get",
        ]
      ~ secret_permissions      = [
          - "Get",
            "List",
          + "Get",
        ]
      ~ storage_permissions     = [
          + "List",
          + "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.product_team_access_policy has changed
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ certificate_permissions = [
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "ManageContacts",
          - "ManageIssuers",
          + "Get",
            "GetIssuers",
            "ListIssuers",
          - "SetIssuers",
          - "DeleteIssuers",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b1fd4154-355f-4683-a795-d09cdb814d16"
      ~ key_permissions         = [
            "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          + "Get",
        ]
      ~ secret_permissions      = [
            "List",
          - "Set",
          - "Delete",
          + "Get",
        ]
      ~ storage_permissions     = [
          + "List",
          + "Get",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg|pre-stg"
        name                       = "pre-stg"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":153,"Program":"tfcmt","SHA1":"","Vars":{}} -->